DataProcessors/фин_ПросмотрДвиженийДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_ПросмотрДвиженийДокумента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бюджетирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Comment>Сумма в валюте упр. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСценария</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоДт1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоДт2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоДт3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоКт1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоКт2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоКт3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоДт4</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоДт5</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоКт4</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконтоКт5</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/фин_Бюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>фин_Бюджетирование</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.фин_Бюджетирование</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Comment>Сумма оценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

DataProcessors/фин_ПросмотрДвиженийДокумента/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура Заполнить()
	Заголовок = "Просмотр движений документа "+Строка(Объект.Документ);
	Объект.РучнаяКорректировка = ?(Объект.Документ.Метаданные().Реквизиты.Найти("РучнаяКорректировка")<>Неопределено,Объект.Документ.РучнаяКорректировка,Ложь);
	МассивУдалить = Новый Массив;
	Для Каждого РеквизитФормы Из ЭтотОбъект.ПолучитьРеквизиты() Цикл
		Если Найти(РеквизитФормы.Имя,"Таблица_")<>0 Тогда
			МассивУдалить.Добавить(РеквизитФормы.Имя);
			Если Элементы.Найти(РеквизитФормы.Имя) <>Неопределено Тогда
				Элементы.Удалить(Элементы[РеквизитФормы.Имя]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Попытка
		ИзменитьРеквизиты(,МассивУдалить);
	Исключение
	КонецПопытки;
	// таблица основных оборотов и контролируемых финансовых показателей
	МассивРегистров = Новый СписокЗначений;
	Для Каждого Движение Из Объект.Документ.Метаданные().Движения Цикл
		Группа = СтрЗаменить(Лев(Движение.ПолноеИмя(),Найти(Движение.ПолноеИмя(),".")-1),"Регистр","Регистры");
		Если Группа = "РегистрыБухгалтерии" Тогда
			Продолжить;
		КонецЕсли;
		МассивРегистров.Добавить(Движение.Имя,Группа);
	КонецЦикла;
	Для Каждого Регистр Из МассивРегистров Цикл
		ИмяТаблицы = "Таблица_"+Регистр.Значение;
		РеквизитТаблица 	= Новый РеквизитФормы(ИмяТаблицы,Новый ОписаниеТипов("ТаблицаЗначений"),,Метаданные[Регистр.Представление][Регистр.Значение].Синоним);
		МассивДобавить = Новый Массив;
		МассивДобавить.Добавить(РеквизитТаблица);
		ИзменитьРеквизиты(МассивДобавить);
		МассивДобавить = Новый Массив;
		Если Регистр.Представление<>"РегистрыРасчета" И НЕ (Регистр.Представление="РегистрыСведений" И Строка(Метаданные.РегистрыСведений.Найти(Регистр.Значение).ПериодичностьРегистраСведений) = "Непериодический") Тогда
			РеквизитКолонка 	= Новый РеквизитФормы("Период",Новый ОписаниеТипов("Дата"),ИмяТаблицы,"Период");
			МассивДобавить.Добавить(РеквизитКолонка);
		КонецЕсли;
		РеквизитКолонка 	= Новый РеквизитФормы("НомерСтроки",Новый ОписаниеТипов("Число"),ИмяТаблицы,"НомерСтроки");
		МассивДобавить.Добавить(РеквизитКолонка);
		Если Регистр.Представление="РегистрыНакопления" И Строка(Метаданные.РегистрыНакопления.Найти(Регистр.Значение).ВидРегистра) = "Остатки" Тогда
			РеквизитКолонка 	= Новый РеквизитФормы("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"),ИмяТаблицы,"НомерСтроки");
			МассивДобавить.Добавить(РеквизитКолонка);
		КонецЕсли;
		Для Каждого Колонка Из Метаданные[Регистр.Представление][Регистр.Значение].Измерения Цикл
			РеквизитКолонка 	= Новый РеквизитФормы(Колонка.Имя,Колонка.Тип,ИмяТаблицы,Колонка.Синоним);
			МассивДобавить.Добавить(РеквизитКолонка);
		КонецЦикла;
		Для Каждого Колонка Из Метаданные[Регистр.Представление][Регистр.Значение].Ресурсы Цикл
			РеквизитКолонка 	= Новый РеквизитФормы(Колонка.Имя,Колонка.Тип,ИмяТаблицы,Колонка.Синоним);
			МассивДобавить.Добавить(РеквизитКолонка);
		КонецЦикла;
		Для Каждого Колонка Из Метаданные[Регистр.Представление][Регистр.Значение].Реквизиты Цикл
			РеквизитКолонка 	= Новый РеквизитФормы(Колонка.Имя,Колонка.Тип,ИмяТаблицы,Колонка.Синоним);
			МассивДобавить.Добавить(РеквизитКолонка);
		КонецЦикла;
		ИзменитьРеквизиты(МассивДобавить);
	КонецЦикла;
	
	Объект.Бюджетирование.Очистить();
	Если Объект.Документ.Метаданные().Движения.Содержит(Метаданные.РегистрыБухгалтерии.фин_Бюджетирование) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрБухгалтерии.фин_Бюджетирование.ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК фин_БюджетированиеДвиженияССубконто
			|ГДЕ
			|	фин_БюджетированиеДвиженияССубконто.Регистратор = &Регистратор";

		Запрос.УстановитьПараметр("Регистратор", Объект.Документ);

		Движенияфин_Бюджетирование = Запрос.Выполнить();

		Объект.Бюджетирование.Загрузить(Движенияфин_Бюджетирование.Выгрузить());
		Элементы.Бюджетирование.Видимость = Объект.Бюджетирование.Количество()>0;
		
	Иначе	
		Элементы.Бюджетирование.Видимость = Ложь;
	КонецЕсли;
	
	ГруппаКолонок = Неопределено;
	Для Каждого Регистр Из МассивРегистров Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	"+СтрЗаменить(Регистр.Представление,"Регистры","Регистр")+"."+Регистр.Значение+" КАК ДвиженияРегистра
			|ГДЕ
			|	ДвиженияРегистра.Регистратор = &Регистратор";

		Запрос.УстановитьПараметр("Регистратор", Объект.Документ);

		ДвиженияРегистра = Запрос.Выполнить().Выгрузить();
		Имя = "Таблица_"+Регистр.Значение;
		Если ДвиженияРегистра.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Страница= Элементы.Добавить("м"+Имя,Тип("ГруппаФормы"),Элементы.Страницы);
		Страница.Вид=ВидГруппыФормы.Страница;
		Страница.Заголовок = Метаданные[Регистр.Представление][Регистр.Значение].Синоним;
		Страница.Картинка = БиблиотекаКартинок.РегистрНакопления;
		ЭлементФормы = Элементы.Добавить(Имя,Тип("ТаблицаФормы"),Страница);
		ЭлементФормы.ПутьКДанным = Имя;
		ЭлементФормы.ЦветТекста = Новый Цвет(25,25,112);
		ЭлементФормы.ЦветРамки = Новый Цвет(176,196,222);
		
		
		Для Каждого Колонка Из ДвиженияРегистра.Колонки Цикл
			Если Колонка.Имя="Регистратор" ИЛИ Колонка.Имя="Активность" ИЛИ Колонка.Имя="МоментВремени" Тогда
				Продолжить;
			КонецЕсли;
			РеквизитКолонка 			= Элементы.Добавить(Имя+Колонка.Имя,Тип("ПолеФормы"),ЭлементФормы);
			РеквизитКолонка.ПутьКДанным	= Имя+"."+Колонка.Имя;
			РеквизитКолонка.ТолькоПросмотр = Истина;
			РеквизитКолонка.ЦветТекстаЗаголовка = Новый Цвет(0,66,66);
			РеквизитКолонка.ЦветФонаЗаголовка = Новый Цвет(176,196,222);
			РеквизитКолонка.ШрифтЗаголовка = Новый Шрифт(,9,Истина);
		КонецЦикла;
		// перенесем данные в таблицу
		Попытка
		ЗначениеВРеквизитФормы(ДвиженияРегистра,Имя);
	Исключение
		КонецПопытки;
		ЭлементФормы.ИзменятьСоставСтрок = Ложь;
		ЭлементФормы.КоманднаяПанель.Видимость = Ложь;
		ЭлементФормы.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Объект.Документ=Параметры.Документ;
		Заполнить();
	Иначе
		Отказ = Истина;
	КонецЕсли;
	Для Инд = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("МаксимальноеКоличествоСубконто")+1 По 5 Цикл
		Элементы["БюджетированиеВидСубконтоДт"+Строка(Инд)].Видимость = Ложь;
		Элементы["БюджетированиеСубконтоДт"+Строка(Инд)].Видимость = Ложь;
		Элементы["БюджетированиеВидСубконтоКт"+Строка(Инд)].Видимость = Ложь;
		Элементы["БюджетированиеСубконтоКт"+Строка(Инд)].Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры
